config.md
- [Config Module](#org42e5bb4)
  - [Usage](#org4a6f522)
  - [Functionality](#orgbd09c88)
    - [Devices](#org68bb64e)
    - [Scenes](#orge0d9e30)
  - [Schema](#org086f29e)
    - [Keys](#org02a5fe7)
  - [Example](#org2d8e11c)


<a id="org42e5bb4"></a>

# Config Module

The *Config Module* for OMOTE introduces the option to define the remote's functionality such as the controlled [Devices](#org68bb64e) and [Scenes](#orge0d9e30) in a declarative way (using a YAML configuration file) instead of the standard imperative approach based on defining the respective configurations by implementing appropriate functions and data structures as code.

Please note that while, in principle, the [Devices](#org68bb64e) and [Scenes](#orge0d9e30) defined declaratively can live side-by-side with code driven definitions, it is not advised as certain functionality (such as [Device List](#org773dcc4) or [Automated Power on/off](#orgea7f413)) will not be available for the imperative definitions.


<a id="org4a6f522"></a>

## Usage

To enable the *Config Module* one needs to define the YAML\_CONFIG build flag in the `platformio.ini` file. Defining that flag has the following effects:

1.  The *Config Module* dependencies (such as the ArduinoJson library) will be **conditionally** enabled and linked.
2.  The main YAML configuration file (defined according to the [Schema](#org086f29e) in a file named `config.yml` - see [Example](#org2d8e11c) ) located in the main OMOTE project directory, will be translated to a header file and compiled into the binary.

The translation and conditional dependencies logic is located in a script file under `tools/conditional_config.py`.


<a id="orgbd09c88"></a>

## Functionality


<a id="org68bb64e"></a>

### Devices

Devices defined via the configuration file (see [Schema](#org086f29e)) are equivalent to the code driven definitions that live in `src/devices`. In addition to the standard set of attributes and customization options inherited from the imperative device definitions, the configuration driven device definitions also allow to define a standard key-map for the device (see `map_short` and `map_long` attributes in the [Schema](#org086f29e)) that can be used as a convenient baseline for a scene key-map (see `scene` / `keys_default` attribute) and will be used in the [Device List](#org773dcc4).

Each command defined within a device configuration, may also include a new `category` attribute (see [Schema](#org086f29e)) that is used to enable the [Automated Power on/off](#orgea7f413) capability.

1.  Device List

    The *Device List* is a new top-level GUI screen which aggregates all devices defined in the configuration file along with their commands. This gives the capability (that would be immediately familiar to any Logitech Harmony user) to invoke any arbitrary command, from any configured device, even if it's not mapped to a physical key.
    
    The GUI presents as a list of devices which expand to the list of their respective commands once a device is "clicked". As long as a device is expanded, the physical key-map will be replaced with the key mappings from that device definition (if available - see `map_short` and `map_long` from [Schema](#org086f29e)). The key-map will be restored to default once a device command list is collapsed


<a id="orge0d9e30"></a>

### Scenes

Scenes, similarly to [Devices](#org68bb64e), are a direct analog to the standard OMOTE's imperatively constructed "scene" entity. The config file [Schema](#org086f29e) allows to define all the standard properties (including "start" and "end" sequences) available in a classic, code driven, scene definition. On top of that the following additional capabilities are available:

1.  Scene GUI

    Each scene gets its own standardized GUI that gives easy access to the scene's "shortcuts" (see below), ability to quickly swipe do the list of devices (see [Device List](#org773dcc4))as well as a quick way to turn all devices involved in the scene off.

2.  Shortcuts

    The configuration file [Schema](#org086f29e) enables to define a list of "shortcuts" for each scene that include semi-frequently accessed commands that for one reason or another are not mapped to physical buttons but should be available for easy access. The list of "shortcuts" is presented on the [Scene GUI](#org543767e).

3.  Automated Power on/off

    The *Config Module* infrastructure tracks the devices that are being turned on (via the `category` attribute attached to commands) in the configured scenes' startup sequences and, as the user switches from one scene to another, makes sure that:
    
    1.  Only the devices required in particular scene remain turned on after switching from a previous scene.
    2.  Only the devices that haven't been already turned on in the previous scene receive a power on or power toggle command.
    3.  Only the devices that are actually on (that is used in the current scene) are switched off when requesting the "all off" function.
    
    This is both handy and necessary in case of devices that are turned on/off via a toggle command, as without that a device would be inadvertently turned off if a new scene was requested that includes powering on a device that have already been turned on in the previous scene.
