config.md


<a id="org086f29e"></a>

## Schema

| Entity        | Attribute      | Type                                           | Description                                                                                                                                                                                                                                                                                               |
|------------- |-------------- |---------------------------------------------- |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| `devices`     |                | dictionary: string -> `device`                 | A dictionary mapping a string representing the unique identifier for a device to a corresponding `device` object                                                                                                                                                                                          |
| `device`      | `display_name` | string                                         | The display name for this device in UI                                                                                                                                                                                                                                                                    |
|               | `protocol`     | enum(string)                                   | The default protocol used in commands communicating with the device. Currently list: SIRC, NEC, RCS, DENON, KASEIKYO (easily expandable in config/parser.cpp)                                                                                                                                             |
|               | `commands`     | list: `command`                                | The list of `command` objects defined for the device                                                                                                                                                                                                                                                      |
| `command`     | `name`         | string                                         | The name of the command. Will be used both for UI and internal accounting.                                                                                                                                                                                                                                |
|               | `data`         | hex number                                     | The data to be sent for the command based on the supported protocol.                                                                                                                                                                                                                                      |
|               | `protocol`     | (optional) enum(string)                        | Overwrites the `device` / `protocol` if specified                                                                                                                                                                                                                                                         |
|               | `nbits`        | (optional) integer                             | Number of bits used for the command. Not required if constant for a protocol with no variants                                                                                                                                                                                                             |
|               | `repeats`      | integer                                        | Number of repeats to send with the command.                                                                                                                                                                                                                                                               |
|               | `category`     | (optional) string                              | A comma delimited string representing the set of standard functional categories that the command belongs to. Two categories are currently supported: *on* and *off*. For example a "power on" command would support the *on* category, while "power toggle" would be categorized as *on,off*              |
|               | `map_short`    | (optional) enum(string)                        | The default key associated with the command on the remote for a "short" press. See [Keys](#org02a5fe7) for the list of supported key designations. This will be used when the device is accessed via the "Device List GUI" or if a scene uses the `keys_default` attribute pointing to the parent device. |
|               | `map_long`     | (optional) enum(string)                        | The default key associated with the command on the remote for a "long" press. See [Keys](#org02a5fe7) for the list of supported key designations. This will be used when the device is accessed via the "Device List GUI" or if a scene uses the `keys_default` attribute pointing to the parent device.  |
| `scenes`      |                | dictionary: string -> `scene`                  | A dictionary mapping a string representing the unique identifier for a scene to a corresponding `scene` object                                                                                                                                                                                            |
| `scene`       | `display_name` | string                                         | The name used for this scene in UI                                                                                                                                                                                                                                                                        |
|               | `keys_default` | (optional) string                              | The unique identifier of a `device` section to be used as source for default physical key mapping in the scene (as retrieved from `command` attributes)                                                                                                                                                   |
|               | `keys_short`   | (optional) dictionary: string -> `command_ref` | A dictionary mapping physical key designators (see [Keys](#org02a5fe7)) to corresponding  commands (via `command_ref` structures) that should be triggered on short press while the scene is active. Any key mappings define here overwrite the default definition inherited via `keys_default`.          |
|               | `keys_long`    | (optional) dictionary: string -> `command_ref` | A dictionary mapping physical key designators (see [Keys](#org02a5fe7)) to corresponding  commands (via `command_ref` structures) that should be triggered on long press while the scene is active. Any key mappings define here overwrite the default definition inherited via `keys_default`.           |
|               | `start`        | list: `command_ref` &vert; `delay`             | A sequence of device commands (represented via `command_ref` structures) or delays (represented via `delay` structure) to be executed when the scene starts.                                                                                                                                              |
|               | `end`          | list: `command_ref` &vert; `delay`             | A sequence of device commands (represented via `command_ref` structures) or delays (represented via `delay` structure) to be executed when the scene ends.                                                                                                                                                |
|               | `shortcuts`    | list: `command_ref`                            | A list of commands (represented by `command_ref` structures) to be presented on this scene's GUI as buttons.                                                                                                                                                                                              |
| `command_ref` | `device`       | string                                         | The unique identifier of the device (see `devices`) that this reference points to.                                                                                                                                                                                                                        |
|               | `command`      | string                                         | The name of the `command` with the device's `commands` list that this reference points to. This attributre is only allowed if `device` attribute is present.                                                                                                                                              |
|               | `scene`        | string                                         | The `display_name` valye of the `scene` to be activated. This attribute is only allowed if neither `device` nor `command` is present.                                                                                                                                                                     |
| `delay`       |                | integer                                        | The number of milliseconds to delay before executing the next step of a sequence.                                                                                                                                                                                                                         |
