config.md


<a id="org02a5fe7"></a>

### Keys

The designators for physical keys used in the configuration YAML scheme. Abbreviations are used to limit the amount of typing required when authoring a configuration.

-   OFF
-   STOP
-   REWI
-   PLAY
-   FORW
-   CONF
-   INFO
-   UP
-   DOWN
-   LEFT
-   RIGHT
-   OK
-   BACK
-   SRC
-   VOLUP
-   VOLDO
-   MUTE
-   REC
-   CHUP
-   CHDOW
-   RED
-   GREEN
-   YELLO
-   BLUE


<a id="org2d8e11c"></a>

## Example

```yaml
scenes:
  watch_tv:
    display_name: Watch TV
    keys_default: sony_bravia
    shortcuts:
      - device: sony_bravia
        command: Netflix
      - device: sony_bravia
        command: Swap

    keys_short:
      UP:
        device: sony_bravia
        command: Down
      DOWN:
        device: sony_bravia
        command: Up
    start:
      - device: sony_bravia
        command: Power

  watch_tv_receiver:
    display_name: Watch TV Receiver
    keys_default: sony_bravia    
    keys_short:
      VOLUP:
        device: denon_x4700h
        command: Volume Up
      VOLDO:
        device: denon_x4700h
        command: Volume Down
      MUTE:
        device: denon_x4700h
        command: Mute

    start:
      - device: sony_bravia
        command: Power        
      - delay: 500
      - device: denon_x4700h
        command: Power Toggle
      - device: denon_x4700h
        command: Input TV


devices:
  denon_x4700h:
    display_name: Denon Receiver
    protocol: DENON
    commands:
    - name: Power Toggle
      data: "0x2A4C028A0088"
      nbits: 48
      repeats: 0
      category: on,off
      map_short: OFF
    - name: Volume Up
      data: "0x2A4C0280E86A"
      nbits: 48
      repeats: 0
      map_short: VOLUP
    - name: Volume Down
      data: "0x2A4C0288E862"
      nbits: 48
      repeats: 0
      map_short: VOLDO
    - name: Input TV
      data: "0x2A4C0284B432"
      nbits: 48
      repeats: 0

  sony_bravia:
    display_name: Sony Bravia
    protocol: SIRC    
    commands:
    - name: Power
      data: '0xA90'
      nbits: 12
      map_short: OFF
      category: on,off
    - name: Input
      data: '0xA50'
      nbits: 12
      map_short: SRC
    - name: Home
      data: '0x070'
      nbits: 12
      map_short: INFO
    - name: Apps
      data: '0x2A23'
      nbits: 15
    - name: Tv
      data: '0x250'
      nbits: 12
    - name: Left
      data: '0x2D0'
      nbits: 12
      map_short: LEFT
    - name: Right
      data: '0xCD0'
      nbits: 12
      map_short: RIGHT
    - name: Up
      data: '0x2F0'
      nbits: 12
      map_short: UP
    - name: Down
      data: '0xAF0'
      nbits: 12
      map_short: DOWN
    - name: Enter
      data: '0xA70'
      nbits: 12
      map_short: OK
    - name: Back
      data: '0x62E9'
      nbits: 15
      map_short: BACK
    - name: Mute
      data: '0x290'
      nbits: 12
      map_short: MUTE
    - name: Vol Up
      data: '0x490'
      nbits: 12
      map_short: VOLUP
    - name: Vol Down
      data: '0xC90'
      nbits: 12
      map_short: VOLDO
    - name: Netflix
      data: '0x1F58'
      nbits: 15
    - name: Swap
      data: '0xDD0'
      nbits: 12

```
